#pragma once

#ifdef _IL2CPP_UNITY

#include "il2cpp.hpp"
#include "crc32.hpp"
#include "math.hpp"
#include <filesystem>

class SafeExecution {
public:
	template<typename T = void*, typename R = void*, typename... Args>
	static T Execute(uint64_t ptr, R ret, Args... args) {
		return reinterpret_cast<T(__fastcall*)(Args...)>(ptr)(args...);
	}
};

class Il2CppType
{
public:
	char* name() {
		static auto off = ProcAddr("il2cpp_type_get_name");
		return call<char*, Il2CppType*>(off, this);
	}
};

class Il2CppMethod {
public:
	uint32_t paramCount() {
		static auto off = ProcAddr("il2cpp_method_get_param_count");
		return call<uint32_t, Il2CppMethod*>(off, this);
	}

	Il2CppType* retType() {
		static auto off = ProcAddr("il2cpp_method_get_return_type");
		return call<Il2CppType*, Il2CppMethod*>(off, this);
	}

	Il2CppType* getParam(uint32_t idx) {
		static auto off = ProcAddr("il2cpp_method_get_param");
		return call<Il2CppType*, Il2CppMethod*, uint32_t>(off, this, idx);
	}

	char* name() {
		static auto off = ProcAddr("il2cpp_method_get_name");
		return call<char*, Il2CppMethod*>(off, this);
	}
};

uint64_t il2cpp_resolve_icall(const char* str) {
	static auto off = ProcAddr("il2cpp_resolve_icall");
	return call<uint64_t, const char*>(off, str);
}
uint64_t il2cpp_object_new(uint64_t klass) {
	static auto off = ProcAddr("il2cpp_object_new");
	return call<uint64_t, uint64_t>(off, klass);
}
class Il2CppField {
public:
	char* name() {
		static auto off = ProcAddr("il2cpp_field_get_name");
		return call<char*, Il2CppField*>(off, this);
	}

	uint32_t offset() {
		static auto off = ProcAddr("il2cpp_field_get_offset");
		return call<uint32_t, Il2CppField*>(off, this);
	}
};

class Il2CppClass
{
public:
	class Il2CppImage* image; //0x0000
	char pad_0008[8]; //0x0008
	char* name; //0x0010
	char* namespaze; //0x0018
	char pad_0020[152]; //0x0020
	void* static_fields; //0x00B8

	Il2CppMethod* methods(void* iter) {
		static auto off = ProcAddr("il2cpp_class_get_methods");
		return call<Il2CppMethod*, Il2CppClass*, void*>(off, this, iter);
	}

	Il2CppField* fields(void* iter) {
		static auto off = ProcAddr("il2cpp_class_get_fields");
		return call<Il2CppField*, Il2CppClass*, void*>(off, this, iter);
	}
}; //Size: 0x00C0

class Il2CppImage
{
public:
	char* assemblyName; //0x0000
	char* name; //0x0008

	uint64_t classcount() {
		static auto off = ProcAddr("il2cpp_image_get_class_count");
		return call<uint64_t, Il2CppImage*>(off, this);
	}

	Il2CppClass* get_class(uint64_t idx) {
		static auto off = ProcAddr("il2cpp_image_get_class");
		return call<Il2CppClass*, Il2CppImage*, uint64_t>(off, this, idx);
	}
}; //Size: 0x0010
template<typename T = System::Object_>
System::Array<T*>* il2cpp_array_new(Il2CppClass* klazz, uint64_t length) {
	static auto off = ProcAddr("il2cpp_array_new");
	auto ret = call<System::Array<T*>*, Il2CppClass*, uint64_t>(off, klazz, length);
	return ret;
}

class Il2CppAssembly {
public:
	uint64_t buffer;
};

class Il2CppDomain {
public:
	size_t assemblyCount() {
		static auto off = ProcAddr("il2cpp_domain_get_assemblies");
		size_t size = 0;
		auto assemblies = call<Il2CppAssembly**, Il2CppDomain*, void*>(off, this, &size);

		return size;

	}

	Il2CppAssembly** assemblies() {
		static auto off = ProcAddr("il2cpp_domain_get_assemblies");
